In [3]:
import pandas as pd

In [5]:
freind_list = [
    ['name',['john','jenny','nate']],
    ['age',[20, 30, 30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(dict(freind_list))

In [6]:
df

    name  age        job
0   john   20    student
1  jenny   30  developer
2   nate   30    teacher

In [8]:
df[1:3]

# 로우 1부터 3까지 순차적 선택

    name  age        job
1  jenny   30  developer
2   nate   30    teacher

In [10]:
df.loc[[0, 2]]
# 순차적이지 않고 로우를 선택하는 예제

   name  age      job
0  john   20  student
2  nate   30  teacher

In [12]:
dfFilter = df[df.age > 25]
dfFilter
# 컬럼값에 따른 로우 선택
# age가 25살 이상인 값만 선택

    name  age        job
1  jenny   30  developer
2   nate   30    teacher

In [13]:
dfFilter = df.query('age > 25')
dfFilter
# 쿼리문으로도 사용 가능

    name  age        job
1  jenny   30  developer
2   nate   30    teacher

In [16]:
dfFilter = df[(df.age > 25) & (df.name == 'nate')]
dfFilter
# 복합적인 조건 사용시

   name  age      job
2  nate   30  teacher

In [18]:
# 컬럼 필터
freind_list = [
    ['john', 20, 'student'],
    ['jenny', 30, 'developer'],
    ['nate', 30, 'teacher']
    ]

df = pd.DataFrame.from_records(freind_list)
df

       0   1          2
0   john  20    student
1  jenny  30  developer
2   nate  30    teacher

In [20]:
df.iloc[:, 0:2]
# 로우는 모두 보여주되 컬럼은 0부터 1까지만
# 앞에가 로우, 뒤에가 컬럼

       0   1
0   john  20
1  jenny  30
2   nate  30

In [23]:
df.iloc[:, [0, 2]]
# 로우를 모두 보여주되, 컬럼은 0과 2만 출력

       0          2
0   john    student
1  jenny  developer
2   nate    teacher

In [27]:
# 컬럼 이름으로 필터
df = pd.read_csv('./pandas/data/friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
# 불러온 파일 컬럼명 지정
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [30]:
dfFilter = df[['name', 'age']]
dfFilter
# 컬럼명이 name, age를 조회

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [32]:
df.filter(items=['age', 'job'])
# 필터 함수를 이용해 조회

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [34]:
df.filter(like='a', axis=1)
# 컬럼명에 'a'가 들어간 컬럼만 조회

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [36]:
df.filter(regex='b$', axis=1)
# 정규식으로도 가능 --> 컬럼명에 'b'가 들어가는 컬럼만 조회

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern